       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAPTURA.
      *--------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT VENDEDOR
             ASSIGN TO RANDOM "VENDEDOR.DAT"
             ORGANIZATION IS INDEXED
             ACCESS MODE IS DYNAMIC
             RECORD KEY IS CODIGO.
      *---------------------------
       DATA DIVISION.
       FILE SECTION.
       FD VENDEDOR.
       01 REG-VENDEDOR.
         05 CODIGO PIC 9(4).
         05 NOMBRE PIC X(20).
         05 TELEFONO PIC X(10).
	 05 CORREO PIC X(20).
	 05 CONTACTO PIC x(30).

       WORKING-STORAGE SECTION.
       01 VARIABLES.
         05 SW PIC 9.
         05 TECLA PIC X.
      *----------------------------
       PROCEDURE DIVISION.
       PRINCIPAL.
           PERFORM ABRIR-ARCHIVO.
           PERFORM PROCESAR UNTIL SW = 1.
           PERFORM CERRAR-ARCHIVO.
           STOP RUN.

       ABRIR-ARCHIVO.
           OPEN I-O VENDEDOR.

       CERRAR-ARCHIVO.
           CLOSE VENDEDOR.

       PROCESAR.
           PERFORM LIMPIAR-PANTALLA.
           PERFORM CAPTURAR-DATOS.

       LIMPIAR-PANTALLA.
           DISPLAY " " LINE 1 POSITION 1 ERASE EOS.
           DISPLAY "CODIGO..." LINE 10 POSITION 10.
           DISPLAY "NOMBRE..." LINE 11 POSITION 10.
           DISPLAY "TELEFONO..." LINE 12 POSITION 10.
	   DISPLAY "CORREO..." LINE 13 POSITION 10.
	   DISPLAY "CONTACTO..." LINE 14 POSITION 10.

       CAPTURAR-DATOS.
           ACCEPT CODIGO LINE 10 POSITION 30 PROMPT NO BEEP
           ACCEPT NOMBRE LINE 11 POSITION 30 PROMPT NO BEEP
           ACCEPT TELEFONO LINE 12 POSITION 30 PROMPT NO BEEP
	   ACCEPT CORREO LINE 13 POSITION 30 PROMPT NO BEEP
	   ACCEPT CONTACTO LINE 14 POSITION 30 PROMPT NO BEEP
           WRITE REG-VENDEDOR
             INVALID KEY
               DISPLAY "ERROR" LINE 23 POSITION 30
               ACCEPT TECLA LINE 23 POSITION 78
             NOT INVALID KEY
               DISPLAY "GRABADO" LINE 23 POSITION 30
               ACCEPT TECLA LINE 23 POSITION 78
             END-WRITE
             DISPLAY "CONTINUAR S/N" LINE 23 POSITION 30
             ACCEPT TECLA LINE 23 POSITION 78 PROMPT
             IF TECLA = "N" OR TECLA = "n"
               MOVE 1 TO SW
             END-IF.
