       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRODUCT.
      *-----------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
               SELECT PRODUCTOS
                   ASSIGN TO RANDOM "PRODUCTO.DAT"
                   ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                   RECORD KEY IS LLAVE-PAL-PD.
               SELECT PLANO
                   ASSIGN TO RANDOM "PRODUCTO.TXT"
                   ORGANIZATION IS LINE SEQUENTIAL.
      *------------------------------
       DATA DIVISION.
       FILE SECTION.
       FD PRODUCTOS.
       01 REG-PRODUCTOS.
           02 LLAVE-PAL-PD.
              03 CODIGO-PD PIC 9(4).
           02 NOMBRE-PD PIC X(30).
           02 LINEA-PD PIC 99.
           02 PROVEEDOR-PD PIC 99.
           02 TIPO-IVA-PD PIC 99.
       FD PLANO.
       01 REG-PLANO PIC X(45).

       WORKING-STORAGE SECTION.
       01 REG-DETALLE.
           05 CODIGO-PD-D PIC Z(4).
           05 FILLER PIC X VALUE "|".
           05 NOMBRE-PD-D PIC X(30).
           05 FILLER PIC X VALUE "|".
           05 LINEA-PD-D PIC X(2).
           05 FILLER PIC X VALUE "|".
           05 PROVEEDOR-PD-D PIC X(2).
           05 FILLER PIC X VALUE "|".
           05 TIPO-IVA-PD-D PIC X(2).

       01 VARIABLES.
           05 SW PIC 9.
           05 TECLA PIC X.
      *----------------------------------
       PROCEDURE DIVISION.
       PRINCIPAL.
           PERFORM ABRIR-ARCHIVOS.
           PERFORM ARRANCAR-ARCHIVO.
           PERFORM PROCESAR UNTIL SW = 1.
           PERFORM CERRAR-ARCHIVOS.
           STOP RUN.

       ABRIR-ARCHIVOS.
           OPEN INPUT PRODUCTOS.
           OPEN OUTPUT PLANO.

       CERRAR-ARCHIVOS.
           CLOSE PRODUCTOS PLANO.

       ARRANCAR-ARCHIVO.
           MOVE ZEROS TO CODIGO-PD.
           START PRODUCTOS KEY IS >= CODIGO-PD
           END-START.

       PROCESAR.
           READ PRODUCTOS NEXT RECORD
             AT END
               MOVE 1 TO SW
             NOT AT END
               MOVE CODIGO-PD TO CODIGO-PD-D
               MOVE NOMBRE-PD TO NOMBRE-PD-D
               MOVE LINEA-PD TO LINEA-PD-D
               MOVE PROVEEDOR-PD TO PROVEEDOR-PD-D
               MOVE TIPO-IVA-PD TO TIPO-IVA-PD-D
               WRITE REG-PLANO FROM REG-DETALLE
             END-READ.
